mahdi-rstgr/Flowrate_sensor/FlowSensor_UI_ESP8266_V3_Charts/FlowSensor_UI_ESP8266/web.h
#pragma once
#include <ESP8266WebServer.h>
#include <uri/UriRegex.h>
#include "sensors.h"   // bring in NUM_SENSORS + get/set_sensor_enabled + extern sensor_enabled[]

#define POLL_INTERVAL_MS 1000
#define STR_HELPER(x) #x
#define STR(x) STR_HELPER(x)

static ESP8266WebServer _server(80);

// Provided by the .ino file
extern void get_ui_snapshot(
  float s_flow_1s[NUM_SENSORS], float s_temp_1s[NUM_SENSORS], 
  float s_mean10[NUM_SENSORS], float s_rms10[NUM_SENSORS], float s_cv10[NUM_SENSORS], 
  bool s_ok[NUM_SENSORS],
  bool& is_recording, bool& is_csv_ready
);
extern void start_run();
extern void stop_run();
extern bool stream_csv_to_client(ESP8266WebServer& server);

// Enhanced HTML Dashboard with Chart.js scatter plots + tables
static const char _PAGE_INDEX[] PROGMEM = R"HTML(<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Flow Sensors Dashboard with Charts</title>
    <script src="https://cdn.jsdelivr.net/npm/chart.js"></script>
    <style>
        * {
            margin: 0;
            padding: 0;
            box-sizing: border-box;
        }

        body {
            font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, sans-serif;
            background: linear-gradient(135deg, #f8f9fa 0%, #ffffff 50%, #f1f3f4 100%);
            min-height: 100vh;
            padding: 20px;
            color: #212529;
        }

        .container {
            max-width: 1600px;
            margin: 0 auto;
        }

        h1 {
            text-align: center;
            font-size: 2.5rem;
            margin-bottom: 30px;
            text-shadow: 1px 1px 2px rgba(0, 0, 0, 0.1);
            letter-spacing: 1px;
            color: #1976d2;
        }

        .view-controls {
            text-align: center;
            margin-bottom: 30px;
        }

        .view-toggle {
            display: inline-flex;
            background: #ffffff;
            border-radius: 12px;
            padding: 4px;
            border: 1px solid rgba(0, 0, 0, 0.1);
            box-shadow: 0 2px 8px rgba(0, 0, 0, 0.08);
        }

        .view-btn {
            padding: 10px 20px;
            background: transparent;
            border: none;
            border-radius: 8px;
            color: #666666;
            cursor: pointer;
            transition: all 0.3s ease;
            font-weight: 500;
        }

        .view-btn.active {
            background: linear-gradient(135deg, #66bb6a, #4caf50);
            color: white;
            box-shadow: 0 4px 12px rgba(76, 175, 80, 0.3);
        }

        .sensors-grid {
            display: grid;
            grid-template-columns: repeat(auto-fit, minmax(380px, 1fr));
            gap: 20px;
            margin-bottom: 30px;
        }

        .sensor-card {
            background: #ffffff;
            border: 1px solid rgba(0, 0, 0, 0.1);
            border-radius: 16px;
            padding: 20px;
            box-shadow: 0 4px 20px rgba(0, 0, 0, 0.08);
            transition: transform 0.3s ease, box-shadow 0.3s ease;
        }

        .sensor-card:hover {
            transform: translateY(-5px);
            box-shadow: 0 8px 30px rgba(0, 0, 0, 0.15);
        }

        .sensor-header {
            display: flex;
            justify-content: space-between;
            align-items: center;
            margin-bottom: 15px;
            padding-bottom: 15px;
            border-bottom: 1px solid rgba(0, 0, 0, 0.1);
        }

        .sensor-title {
            font-size: 1.2rem;
            font-weight: 600;
            color: #1976d2;
        }

        .sensor-info {
            display: flex;
            gap: 15px;
            font-size: 0.9rem;
            margin-bottom: 15px;
            flex-wrap: wrap;
        }

        .info-badge {
            background: rgba(25, 118, 210, 0.1);
            padding: 5px 12px;
            border-radius: 20px;
            border: 1px solid rgba(25, 118, 210, 0.2);
            color: #1976d2;
        }

        .status-ok {
            color: #81c784;
        }

        .status-error {
            color: #ef5350;
        }

        .metrics {
            margin-bottom: 20px;
        }

        .metric-row {
            font-size: 1.1rem;
            font-weight: bold;
            margin: 8px 0;
            color: #1976d2;
        }

        .metric-label {
            font-size: 0.85rem;
            color: #666666;
            font-weight: normal;
        }

        /* Chart container */
        .chart-container {
            position: relative;
            height: 300px;
            margin-bottom: 20px;
            background: #f8f9fa;
            border-radius: 12px;
            padding: 10px;
            border: 1px solid rgba(0, 0, 0, 0.05);
        }

        .chart-title {
            text-align: center;
            color: #1976d2;
            font-size: 0.9rem;
            margin-bottom: 10px;
            font-weight: 500;
        }

        /* Table styles */
        .table-container {
            overflow-x: auto;
            border-radius: 12px;
            background: #f8f9fa;
            border: 1px solid rgba(0, 0, 0, 0.05);
        }

        .data-table {
            width: 100%;
            border-collapse: collapse;
            font-size: 0.85rem;
        }

        .data-table th {
            background: rgba(25, 118, 210, 0.1);
            padding: 8px;
            text-align: left;
            font-weight: 600;
            color: #1976d2;
            border-bottom: 2px solid rgba(0, 0, 0, 0.1);
        }

        .data-table td {
            padding: 6px 8px;
            border-bottom: 1px solid rgba(0, 0, 0, 0.05);
        }

        .data-table tr:hover {
            background: rgba(25, 118, 210, 0.05);
        }

        .controls {
            background: #ffffff;
            border: 1px solid rgba(0, 0, 0, 0.1);
            border-radius: 16px;
            padding: 25px;
            box-shadow: 0 4px 20px rgba(0, 0, 0, 0.08);
        }

        .controls-header {
            font-size: 1.3rem;
            font-weight: 600;
            margin-bottom: 20px;
            color: #1976d2;
            text-align: center;
        }

