mahdi-rstgr/Flowrate_sensor/FlowSensor_UI_ESP8266_V3_Charts/FlowSensor_UI_ESP8266/web.h
        .control-buttons {
            display: flex;
            gap: 15px;
            justify-content: center;
            flex-wrap: wrap;
            margin-bottom: 20px;
        }

        .btn {
            padding: 12px 28px;
            border: none;
            border-radius: 12px;
            font-size: 1rem;
            font-weight: 600;
            cursor: pointer;
            transition: all 0.3s ease;
            box-shadow: 0 4px 12px rgba(0, 0, 0, 0.2);
            text-transform: uppercase;
            letter-spacing: 0.5px;
            text-decoration: none;
            display: inline-block;
        }

        .btn:disabled {
            opacity: 0.5;
            cursor: not-allowed;
        }

        .btn-start {
            background: linear-gradient(135deg, #66bb6a, #4caf50);
            color: white;
        }

        .btn-start:hover:not(:disabled) {
            background: linear-gradient(135deg, #4caf50, #388e3c);
            transform: translateY(-2px);
            box-shadow: 0 6px 16px rgba(76, 175, 80, 0.4);
        }

        .btn-stop {
            background: linear-gradient(135deg, #ef5350, #e53935);
            color: white;
        }

        .btn-stop:hover:not(:disabled) {
            background: linear-gradient(135deg, #e53935, #c62828);
            transform: translateY(-2px);
            box-shadow: 0 6px 16px rgba(239, 83, 80, 0.4);
        }

        .btn-download {
            background: linear-gradient(135deg, #42a5f5, #2196f3);
            color: white;
        }

        .btn-download:hover {
            background: linear-gradient(135deg, #2196f3, #1976d2);
            transform: translateY(-2px);
            box-shadow: 0 6px 16px rgba(66, 165, 245, 0.4);
        }

        .control-info {
            display: flex;
            justify-content: space-around;
            gap: 20px;
            margin-top: 20px;
            flex-wrap: wrap;
        }

        .info-item {
            text-align: center;
            padding: 10px 15px;
            background: rgba(25, 118, 210, 0.05);
            border-radius: 10px;
            flex: 1;
            min-width: 150px;
        }

        .info-label {
            font-size: 0.85rem;
            color: #666666;
            margin-bottom: 5px;
        }

        .info-value {
            font-size: 1.1rem;
            font-weight: 600;
            color: #1976d2;
        }

        .footer {
            text-align: center;
            margin-top: 30px;
            padding: 20px;
            color: #666666;
            font-size: 0.9rem;
        }

        /* Hide/show content based on view mode */
        .view-tables .chart-container {
            display: none;
        }

        .view-charts .table-container {
            display: none;
        }

        @media (max-width: 768px) {
            h1 {
                font-size: 1.8rem;
            }
            
            .sensors-grid {
                grid-template-columns: 1fr;
            }
            
            .control-buttons {
                flex-direction: column;
            }
            
            .btn {
                width: 100%;
            }

            .chart-container {
                height: 250px;
            }
        }
    </style>
</head>
<body>
    <div class="container">
        <h1>Flow Sensors Dashboard</h1>
        
        <div class="view-controls">
            <div class="view-toggle">
                <button class="view-btn active" onclick="setViewMode('both')">Tables + Charts</button>
                <button class="view-btn" onclick="setViewMode('tables')">Tables Only</button>
                <button class="view-btn" onclick="setViewMode('charts')">Charts Only</button>
            </div>
        </div>
        
        <div class="sensors-grid" id="sensorsGrid">
            <!-- Sensor 1 -->
            <div class="sensor-card" id="sensor1">
                <div class="sensor-header">
                    <span class="sensor-title">SENSOR 1</span>
                </div>
                <div class="sensor-info">
                    <span class="info-badge">Temp: <span id="temp1">--</span> °C</span>
                    <span class="info-badge">Status: <span class="status-ok" id="status1">OK</span></span>
                </div>
                <div class="metrics">
                    <div class="metric-row">
                        <span class="metric-label">Mean: </span><span id="mean1">--</span> mL/min
                    </div>
                    <div class="metric-row">
                        <span class="metric-label">RMS: </span><span id="rms1">--</span> mL/min
                    </div>
                </div>
                <div class="chart-container">
                    <div class="chart-title">Flow vs Sample Number - Sensor 1</div>
                    <canvas id="chart1"></canvas>
                </div>
                <div class="table-container">
                    <table class="data-table">
                        <thead>
                            <tr>
                                <th>Number</th>
                                <th>Flow (mL/min)</th>
                                <th>Temp (°C)</th>
                            </tr>
                        </thead>
                        <tbody id="data1"></tbody>
                    </table>
                </div>
            </div>

            <!-- Sensor 2 -->
            <div class="sensor-card" id="sensor2">
                <div class="sensor-header">
                    <span class="sensor-title">SENSOR 2</span>
                </div>
                <div class="sensor-info">
                    <span class="info-badge">Temp: <span id="temp2">--</span> °C</span>
                    <span class="info-badge">Status: <span class="status-ok" id="status2">OK</span></span>
                </div>
                <div class="metrics">
                    <div class="metric-row">
                        <span class="metric-label">Mean: </span><span id="mean2">--</span> mL/min
                    </div>
                    <div class="metric-row">
                        <span class="metric-label">RMS: </span><span id="rms2">--</span> mL/min
                    </div>
                </div>
                <div class="chart-container">
                    <div class="chart-title">Flow vs Sample Number - Sensor 2</div>
                    <canvas id="chart2"></canvas>
                </div>
                <div class="table-container">
                    <table class="data-table">
                        <thead>
                            <tr>
                                <th>Number</th>
                                <th>Flow (mL/min)</th>
                                <th>Temp (°C)</th>
                            </tr>
                        </thead>
                        <tbody id="data2"></tbody>
                    </table>
                </div>
            </div>

            <!-- Sensor 3 -->
            <div class="sensor-card" id="sensor3">
                <div class="sensor-header">
                    <span class="sensor-title">SENSOR 3</span>
                </div>
                <div class="sensor-info">
                    <span class="info-badge">Temp: <span id="temp3">--</span> °C</span>
                    <span class="info-badge">Status: <span class="status-ok" id="status3">OK</span></span>
                </div>
                <div class="metrics">
                    <div class="metric-row">
                        <span class="metric-label">Mean: </span><span id="mean3">--</span> mL/min
                    </div>
                    <div class="metric-row">
                        <span class="metric-label">RMS: </span><span id="rms3">--</span> mL/min
                    </div>
                </div>
                <div class="chart-container">
                    <div class="chart-title">Flow vs Sample Number - Sensor 3</div>
                    <canvas id="chart3"></canvas>
                </div>
                <div class="table-container">
                    <table class="data-table">
                        <thead>
                            <tr>
                                <th>Number</th>
                                <th>Flow (mL/min)</th>
                                <th>Temp (°C)</th>
                            </tr>
                        </thead>
                        <tbody id="data3"></tbody>
                    </table>
                </div>
            </div>

            <!-- Sensor 4 -->
            <div class="sensor-card" id="sensor4">
                <div class="sensor-header">
                    <span class="sensor-title">SENSOR 4</span>
                </div>
                <div class="sensor-info">
                    <span class="info-badge">Temp: <span id="temp4">--</span> °C</span>
                    <span class="info-badge">Status: <span class="status-ok" id="status4">OK</span></span>
                </div>
                <div class="metrics">
                    <div class="metric-row">
                        <span class="metric-label">Mean: </span><span id="mean4">--</span> mL/min
                    </div>
                    <div class="metric-row">
                        <span class="metric-label">RMS: </span><span id="rms4">--</span> mL/min
                    </div>
                </div>
                <div class="chart-container">
                    <div class="chart-title">Flow vs Sample Number - Sensor 4</div>
                    <canvas id="chart4"></canvas>
                </div>
                <div class="table-container">
                    <table class="data-table">
                        <thead>
                            <tr>
                                <th>Number</th>
                                <th>Flow (mL/min)</th>
                                <th>Temp (°C)</th>
                            </tr>
                        </thead>
                        <tbody id="data4"></tbody>
                    </table>
                </div>
            </div>
        </div>

        <div class="controls">
            <h2 class="controls-header">CONTROLS</h2>
            <div class="control-buttons">
                <button class="btn btn-start" id="btnStart" onclick="startMonitoring()">Start</button>
                <button class="btn btn-stop" id="btnStop" onclick="stopMonitoring()" disabled>Stop</button>
                <a class="btn btn-download" id="btnDownload" href="/log.csv" style="display:none;">Download CSV</a>
            </div>
            <div class="control-info">
                <div class="info-item">
                    <div class="info-label">Auto poll</div>
                    <div class="info-value" id="autopoll">on</div>
                </div>
                <div class="info-item">
                    <div class="info-label">Last update</div>
                    <div class="info-value" id="lastupdate">--</div>
                </div>
                <div class="info-item">
                    <div class="info-label">Interval</div>
                    <div class="info-value" id="interval">)HTML" STR(POLL_INTERVAL_MS) R"HTML( ms</div>
                </div>
            </div>
        </div>

        <div class="footer">
            Served by ESP8266 • Enhanced with Charts
        </div>
    </div>

    <script>
        const NUM_SENSORS = 4;
        const MAX_ROWS = 30;
        const MAX_CHART_POINTS = 50;
        let sensorData = [[], [], [], []];
        let chartData = [[], [], [], []];
        let updateInterval;
        let metricsTick = 0;
        let sampleCounter = 0;
        let charts = [];

        // Initialize charts
        function initCharts() {
            const chartColors = [
                'rgba(76, 175, 80, 1)',   // Green
                'rgba(33, 150, 243, 1)',  // Blue  
                'rgba(255, 152, 0, 1)',   // Orange
                'rgba(156, 39, 176, 1)'   // Purple
            ];

            for (let i = 1; i <= NUM_SENSORS; i++) {
                const ctx = document.getElementById('chart' + i).getContext('2d');
                const chart = new Chart(ctx, {
                    type: 'scatter',
                    data: {
                        datasets: [{
                            label: 'Flow (mL/min)',
                            data: [],
                            backgroundColor: chartColors[i-1],
                            borderColor: chartColors[i-1],
                            pointRadius: 4,
                            pointHoverRadius: 6,
                            tension: 0.1,
                            showLine: true
                        }]
                    },
                    options: {
                        responsive: true,
                        maintainAspectRatio: false,
                        plugins: {
                            legend: {
                                labels: {
                                    color: '#1976d2'
                                }
                            }
                        },
                        scales: {
                            x: {
                                title: {
                                    display: true,
                                    text: 'Sample Number',
                                    color: '#1976d2'
                                },
                                grid: {
                                    color: 'rgba(0, 0, 0, 0.1)'
                                },
                                ticks: {
                                    color: '#666666'
                                }
                            },
                            y: {
                                title: {
                                    display: true,
                                    text: 'Flow Rate (mL/min)',
                                    color: '#1976d2'
                                },
                                grid: {
                                    color: 'rgba(0, 0, 0, 0.1)'
                                },
                                ticks: {
                                    color: '#666666'
                                }
                            }
                        },
                        interaction: {
                            intersect: false,
                            mode: 'nearest'
                        },
                        animation: {
                            duration: 300
                        }
                    }
                });
                charts.push(chart);
            }
        }

        // View mode control
        function setViewMode(mode) {
            document.querySelectorAll('.view-btn').forEach(btn => btn.classList.remove('active'));
            event.target.classList.add('active');
            
            const container = document.getElementById('sensorsGrid');
            container.className = 'sensors-grid view-' + mode;
        }

        function startMonitoring() {
            fetch('/start', { method: 'POST' })
                .then(() => {
                    document.getElementById('autopoll').textContent = 'on';
                    document.getElementById('btnStart').disabled = true;
                    document.getElementById('btnStop').disabled = false;
                    document.getElementById('btnDownload').style.display = 'none';
                    
                    // Reset charts and data
                    sampleCounter = 0;
                    sensorData = [[], [], [], []];
                    chartData = [[], [], [], []];
                    charts.forEach(chart => {
                        chart.data.datasets[0].data = [];
                        chart.update();
                    });
                    
                    if (!updateInterval) {
                        updateInterval = setInterval(updateData, )HTML" STR(POLL_INTERVAL_MS) R"HTML();
                    }
                    updateData();
                })
                .catch(e => console.error('Start error:', e));
        }

        function stopMonitoring() {
            fetch('/stop', { method: 'POST' })
                .then(() => {
                    document.getElementById('btnStart').disabled = false;
                    document.getElementById('btnStop').disabled = true;
                    updateData(); // one last refresh to reveal CSV button
                })
                .catch(e => console.error('Stop error:', e));
        }

        function updateData() {
            fetch('/api', { cache: 'no-store' })
                .then(response => response.json())
                .then(data => {
                    sampleCounter++;
                    document.getElementById('lastupdate').textContent = new Date().toLocaleTimeString();
                    
                    // Update download button visibility
                    const dlBtn = document.getElementById('btnDownload');
                    if (data.run && data.run.csv_ready) {
                        dlBtn.style.display = 'inline-block';
                    } else {
                        dlBtn.style.display = 'none';
                    }

                    // Update all sensors
                    for (let i = 1; i <= NUM_SENSORS; i++) {
                        const sensor = data['s' + i];
                        if (!sensor) continue;

                        const statusEl = document.getElementById('status' + i);

                        // Status
                        statusEl.textContent = sensor.ok ? 'OK' : 'ERROR';
                        statusEl.className = sensor.ok ? 'status-ok' : 'status-error';

                        // Temperature
                        document.getElementById('temp' + i).textContent = sensor.temp_1s.toFixed(2);

                        // Rolling data table
                        sensorData[i-1].unshift({
                            flow: sensor.flow_1s,
                            temp: sensor.temp_1s
                        });
                        if (sensorData[i-1].length > MAX_ROWS) {
                            sensorData[i-1].pop();
                        }

