mahdi-rstgr/Flowrate_sensor/FlowSensor_UI_ESP8266_V3_Charts/FlowSensor_UI_ESP8266/web.h
                        // Update table
                        const tbody = document.getElementById('data' + i);
                        tbody.innerHTML = sensorData[i-1].map((row, idx) => 
                            '<tr><td>' + (idx + 1) + '</td><td>' + 
                            row.flow.toFixed(3) + '</td><td>' + 
                            row.temp.toFixed(2) + '</td></tr>'
                        ).join('');

                        // Update chart data
                        const chartIndex = i - 1;
                        const chart = charts[chartIndex];
                        
                        // Add new point
                        chart.data.datasets[0].data.push({
                            x: sampleCounter,
                            y: sensor.flow_1s
                        });
                        
                        // Keep only last MAX_CHART_POINTS
                        if (chart.data.datasets[0].data.length > MAX_CHART_POINTS) {
                            chart.data.datasets[0].data.shift();
                        }
                        
                        chart.update('none'); // No animation for real-time updates

                        // Update metrics every 10 polls
                        if (metricsTick === 0) {
                            document.getElementById('mean' + i).textContent = sensor.mean10.toFixed(3);
                            document.getElementById('rms' + i).textContent = sensor.rms10.toFixed(3);
                        }
                    }

                    metricsTick = (metricsTick + 1) % 10;
                })
                .catch(e => console.error('Update error:', e));
        }

        // Start passive polling on page load
        window.addEventListener('DOMContentLoaded', () => {
            initCharts();
            updateData();
            updateInterval = setInterval(updateData, )HTML" STR(POLL_INTERVAL_MS) R"HTML();
        });
    </script>
</body>
</html>)HTML";

// HTTP Handler Functions (same as before)
static void _handle_root() { 
    _server.send_P(200, "text/html", _PAGE_INDEX); 
}

static void _handle_api() {
    float f_1s[NUM_SENSORS], t_1s[NUM_SENSORS];
    float m10[NUM_SENSORS], r10[NUM_SENSORS], cv10[NUM_SENSORS];
    bool ok[NUM_SENSORS];
    bool rec, csv;
    
    get_ui_snapshot(f_1s, t_1s, m10, r10, cv10, ok, rec, csv);

    String json = "{";
    for (int i = 0; i < NUM_SENSORS; i++) {
        json += "\"s" + String(i + 1) + "\":{";
        json += "\"flow_1s\":" + String(f_1s[i], 3) + ",";
        json += "\"temp_1s\":" + String(t_1s[i], 3) + ",";
        json += "\"mean10\":" + String(m10[i], 3) + ",";
        json += "\"rms10\":" + String(r10[i], 3) + ",";
        json += "\"cv10\":" + String(cv10[i], 2) + ",";
        json += "\"ok\":" + String(ok[i] ? "true" : "false") + ",";
        json += "\"enabled\":" + String(get_sensor_enabled((uint8_t)(i + 1)) ? "true" : "false");
        json += "}";
        if (i < NUM_SENSORS - 1) json += ",";
    }
    
    json += ",\"run\":{";
    json += "\"recording\":" + String(rec ? "true" : "false") + ",";
    json += "\"csv_ready\":" + String(csv ? "true" : "false");
    json += "}}";
    
    _server.send(200, "application/json", json);
}

static void _handle_start() { 
    start_run(); 
    _server.send(200, "text/plain", "started"); 
}

static void _handle_stop() {  
    stop_run();  
    _server.send(200, "text/plain", "stopped"); 
}

static void _handle_log() {
    if (!stream_csv_to_client(_server)) {
        _server.send(404, "text/plain", "No CSV data available. Record data first.");
    }
}

static void _handle_sensor_toggle() {
    int sensor_id = _server.pathArg(0).toInt();
    String action = _server.pathArg(1);
    bool enable = (action == "on");
    
    if (sensor_id >= 1 && sensor_id <= NUM_SENSORS) {
        set_sensor_enabled((uint8_t)sensor_id, enable);
        _server.send(200, "text/plain", enable ? "enabled" : "disabled");
    } else {
        _server.send(400, "text/plain", "Invalid sensor ID");
    }
}

static void _handle_not_found() {
    _server.send(404, "text/plain", "404: Not Found");
}

// Setup and Loop Functions
inline void web_begin() {
    _server.on("/", HTTP_GET, _handle_root);
    _server.on("/api", HTTP_GET, _handle_api);
    _server.on("/start", HTTP_POST, _handle_start);
    _server.on("/stop", HTTP_POST, _handle_stop);
    _server.on("/log.csv", HTTP_GET, _handle_log);
    _server.on(UriRegex("/sensor/(\\d+)/(on|off)"), HTTP_POST, _handle_sensor_toggle);
    _server.onNotFound(_handle_not_found);
    _server.begin();
    Serial.println("[WEB] Server started on port 80");
}

inline void web_loop() { 
    _server.handleClient(); 
}